Repository: Cosyment/Chatty
Catalog: lib/l10n/intl_*.arb
Languages: de, fr, ja, ru, zh, zh_tw

source: Chat
ja: チャット
ru: Чат
zh: 对话
zh_tw: 閒聊

source: Discover
ja: ディスカバー
zh_tw: 發現

source: More
ja: もっとその
zh_tw: 更多

source: Conversations
de: Gespräche
ja: ダイアログ
ru: Диалоги
zh: 会话
zh_tw: 對話

source: Settings
de: Einstellungen
fr: Paramètres
ja: 設定＃セッテイ＃
ru: Настройки
zh: 设置
zh_tw: 設定

source: Version
ja: バージョン
ru: Версия
zh: 版本
zh_tw: 版本

source: Clear conversation
de: Unterhaltung löschen
fr: Effacer la conversation
ja: はっきりした会話
ru: Очистить диалог
zh: 清空会话
zh_tw: 清空會話

# clear_conversation_tips
source: Would you like to clear conversation history?
de: Möchten Sie den Chatverlauf wirklich löschen?
fr: Voulez-vous vraiment effacer l'historique de la conversation ?
ja: 会話履歴をクリアしたいですか?
ru: Вы действительно хотите очистить историю диалога?
zh: 确认清空会话历史吗?
zh_tw: 你想清除對話歷史記錄嗎?

source: Resend
de: Erneut senden
fr: Renvoyer
ja: 再送信
ru: Отправить повторно
zh: 重试
zh_tw: 重新發送

source: Edit
de: Bearbeiten
fr: Modifier
ja: 編集
ru: Редактировать
zh: 编辑
zh_tw: 編輯

source: Send a message...
de: Nachricht senden...
fr: Envoyer un message...
ja: メッセージを送信...
ru: Отправить сообщение...
zh: 发送消息...
zh_tw: 發送消息...

source: Cancel
de: Abbrechen
fr: Annuler
ja: キャンセル
ru: Отмена
zh: 取消
zh_tw: 取消

source: OK
ja: わかった
ru: ОК
zh: 确认
zh_tw: 好

source: Invalid API Key
de: Ungültiger API-Schlüssel
fr: Clé d'API invalide
ja: 無効な API Key
ru: Неверный API ключ
zh: 无效API Key
zh_tw: 無效的API Key

source: Authentication
de: Authentifizierung
fr: Authentification
ja: 認証
ru: Аутентификация
zh: 验证
zh_tw: 身份驗證

# add_your_secret_api_key
source: Add your api key
de: Geben Sie Ihren geheimen API-Schlüssel ein
fr: Ajoutez votre clé d'API secrète
ja: 追加 API key
ru: Добавьте ваш API ключ
zh: 添加API Key
zh_tw: 添加API key

# please_add_your_api_key
source: Please add your api key first
de: Bitte fügen Sie zuerst Ihren API-Schlüssel hinzu
fr: Veuillez d'abord ajouter votre clé d'API
ja: 最初に API キーを追加してください
ru: Пожалуйста, сначала добавьте API ключ
zh: 请先添加您的API Key
zh_tw: 請先添加您的API Key

source: Organization
de: Organisation
fr: Organisation
ja: 組織
ru: Организация
zh: 组织
zh_tw: 組織

# custom_api_host
source: Customization API Host
de: Benutzerdefinierter API-Host
fr: Hôte d'API personnalisé
ja: カスタマイズ API Host
ru: Пользовательский API хост
zh: 自定义域名
zh_tw: 定製 API Host

source: API Host Optional
fr: Hôte API (facultatif)
ja: API Host オプション
ru: API хост (необязательно)
zh: 接口域名
zh_tw: API Host 可選

# manage_api_keys
source: Find Keys
de: Schlüssel verwalten
fr: Trouver des clés
ja: 見付けるKeys
ru: Найти ключи
zh: 查看Keys
zh_tw: 尋找 Keys

source: Chat Parameters
de: Chat-Parameter
fr: Paramètres du chat
ja: チャットパラメータ
ru: Параметры чата
zh: 聊天参数
zh_tw: 聊天參數

source: Model
de: Modell
fr: Modèle
ja: モデルとなって着る
ru: Модель
zh: 模型
zh_tw: 模型

source: History Limit
de: Verlaufsgrenze
fr: Limite d'historique
ja: 履歴の制限
ru: Лимит истории
zh: 记录限制
zh_tw: 記錄限制

source: Appearance
de: Erscheinungsbild
fr: Apparence
ja: の表面に化粧張りを
ru: Внешний вид
zh: 界面
zh_tw: 外觀

source: Render Mode
de: Rendermodus
fr: Mode d'affichage
ja: レンダリングモード
ru: Режим отображения
zh: 渲染模式
zh_tw: 渲染模式

source: About
de: Über
fr: À propos
ja: について
ru: О приложении
zh: 关于
zh_tw: 關於

source: Privacy
de: Datenschutz
fr: Vie privée
ja: プライバシー
ru: Конфиденциальность
zh: 隐私政策
zh_tw: 隱私

source: Title should not be empty
de: Titel darf nicht leer sein
fr: Le titre ne doit pas être vide
ja: タイトルは空ではありません
ru: Заголовок не должен быть пустым
zh: 标题不能为空
zh_tw: 標題不應為空

source: Enter a conversation title
de: Geben Sie einen Gesprächstitel ein
fr: Entrez un titre de conversation
ja: ダイアログのタイトルを入力
ru: Введите заголовок диалога
zh: 输入会话标题
zh_tw: 輸入對話標題

source: Message to help set the behavior of the
de: Nachricht, um das Verhalten festzulegen
fr: Message pour aider à définir le comportement de
ja: 設定した動作を支援するメッセージ
ru: Сообщение для настройки поведения
zh: 您可以输入AI角色及身份信息，帮助AI更好理解您的问题，给出更加专业的回复
zh_tw: 你可以輸入AI角色及身份資訊，幫助AI更好理解您的問題，給出更加專業的回復

source: Edit conversation
de: Unterhaltung bearbeiten
fr: Modifier la conversation
ja: ダイアログの編集
ru: Редактировать диалог
zh: 编辑会话
zh_tw: 編輯對話

source: New conversation
de: Neue Unterhaltung
fr: Nouvelle conversation
ja: 新しい会話
ru: Новый диалог
zh: 创建会话
zh_tw: 新對話

source: Delete conversation
de: Unterhaltung löschen
fr: Supprimer la conversation
ja: ダイアログの削除
ru: Удалить диалог
zh: 删除会话
zh_tw: 删除對話

# delete_conversation_tips
source: Would you like to delete the conversation?
de: Möchten Sie die Unterhaltung wirklich löschen?
fr: Voulez-vous vraiment supprimer cette conversation ?
ja: 会話を削除したいですか?
ru: Вы действительно хотите удалить этот диалог?
zh: 确认要删除当前会话吗？
zh_tw: 你想删除對話嗎?

source: Delete
de: Löschen
fr: Supprimer
ja: 削除
ru: Удалить
zh: 删除
zh_tw: 删去

# create_conversation_to_start
source: Create or select a conversation
de: Erstellen oder wählen Sie eine Unterhaltung aus
fr: Créez ou sélectionnez une conversation
ja: セッションを作成または選択します
ru: Создайте или выберите диалог
zh: 创建或选择会话
zh_tw: 創建或選擇會話

# create_conversation_tip
source: tips: Entering '/' can trigger more surprises
de: Tipp: Verwenden Sie '/' um mehr Überraschungen auszulösen
fr: Astuce : Saisir '/' peut déclencher plus de surprises
ja: tips：'/'を入力すると、より多くの驚きをトリガーできますよ
ru: совет: ввод '/' может вызвать еще сюрпризы
zh: tips: 输入'/'能触发更多惊喜哦
zh_tw: tips:輸入'/'能觸發更多驚喜哦

source: Other
de: Andere
fr: Autre
ja: 他の
ru: Другое
zh: 其他
zh_tw: 其他

source: Reset API Key
de: API-Schlüssel zurücksetzen
fr: Réinitialiser la clé d'API
ja: APIキーをリセット
ru: Сброс API ключа
zh: 重置API Key
zh_tw: 重置API Key

# reset_api_key_tips
source: Are you sure you want to reset the api key? After the reset, you need to add a new api key or restart the app
de: Möchten Sie den API-Schlüssel wirklich zurücksetzen? Danach müssen Sie einen neuen API-Schlüssel hinzufügen oder die App neu starten
fr: Êtes-vous sûr de vouloir réinitialiser la clé d'API ? Après la réinitialisation, vous devrez ajouter une nouvelle clé d'API ou redémarrer l'application
ja: API キーをリセットしてもよろしいですか? リセット後、新しい API キーを追加するか、アプリを再起動する必要がありますか
ru: Вы уверены, что хотите сбросить API ключ? После сброса вам нужно будет добавить новый API ключ или перезапустить приложение
zh: 确定重置API Key吗？重置后您需要添加新的API Key或重启APP
zh_tw: 您確定要重置API Key嗎？ 重置後您需要添加新的API Key或重新啟動應用程序

# prompt
source: Prompts
de: Aufforderungen
fr: Invites
ja: プロンプト
ru: Подсказки
zh: 提示词
zh_tw: 提示語

# reminder
source: Tips
de: Erinnerung
fr: Astuce
ja: 暖かいヒント
ru: Совет
zh: 温馨提示
zh_tw: 温馨提示

# clean_conversation_tips
source: Are you sure to clear all conversationsï¼Ÿ
de: Möchten Sie wirklich alle Unterhaltungen löschen?
fr: Voulez-vous vraiment supprimer toutes les conversations ?
ja: すべてのセッションをクリアすることを確認しますか？
ru: Вы уверены, что хотите очистить все диалоги?
zh: 确认清空所有会话吗？
zh_tw: 確認清空所有會話嗎？

# conversation_chat_reached_limit
source: The chat frequency has reached the limit today. Please check the advertisement to unlock more times
de: Das Chat-Limit für heute wurde erreicht. Bitte schauen Sie sich Anzeigen an, um mehr freizuschalten
fr: La limite de chat d'aujourd'hui a été atteinte. Veuillez regarder la publicité pour débloquer plus
ja: 今日はチャットの頻度が限界に達しました。広告を見てロックを解除してください
ru: Лимит чатов для сегодня исчерпан. Посмотрите рекламу, чтобы разблокировать еще
zh: 今日聊天次数已经用完啦，看广告可以获取更多聊天次数哦！
zh_tw: 今日聊天次數已經用完啦，看廣告可以獲取更多聊天次數哦！

source: Language
de: Sprache
fr: Langue
ja: 言語
ru: Язык
zh: 语言设置
zh_tw: 語言

# language_code
source: English
de: Deutsch
fr: Français
ja: 日本語
ru: Русский язык
zh: 简体中文
zh_tw: 繁體中文

# ad_load_failure
source: Ad load failure,Please try again!
de: Fehler beim Laden der Werbung, bitte versuchen Sie es erneut!
fr: Erreur lors du chargement de la publicité. Veuillez réessayer !
ja: 広告の読み込みに失敗しました。再度お試しください
ru: Ошибка загрузки рекламы, пожалуйста, попробуйте еще раз!
zh: 广告加载失败，请稍后再试
zh_tw: 廣告載入失敗,請重試!

source: Premium
de: Prämie
fr: Frais d'assurance
ja: プレミアム
ru: Премиум
zh: 会员订阅
zh_tw: 會員訂閱

# premium_plus_explain
source: Premium Features
de: Prämie Funktionen
fr: Fonctionnalités frais d'assurance Plus
ja: プラスプレミアム機能
ru: Премиум-плюс функции
zh: Plus 高级会员权益
zh_tw: 高級會員權益

# premium_features1
source: Send Unlimited
de: Unbegrenztes Senden
fr: Envoyer sans limite
ja: 無制限送信
ru: Неограниченная отправка
zh: 聊天无限制
zh_tw: 聊天無限制

# premium_features2
source: Support GPT4
de: Unterstützung für GPT4
fr: Prise en charge de GPT4
ja: GPT4サポート
ru: Поддержка GPT4
zh: 支持GPT4
zh_tw: 支援GPT4

# premium_features3
source: Support Markdown Render
de: Unterstützung für Markdown-Render
fr: Prise en charge du rendu Markdown
ja: Markdownレンダーサポート
ru: Поддержка разметки Markdown
zh: 支持Markdown渲染
zh_tw: 支援Markdown渲染

# premium_features4
source: Higher word limit
de: Höhere Wortgrenze
fr: Limite de mots plus élevée
ja: より高い単語制限
ru: Более высокий лимит слов
zh: 更高的字数上限
zh_tw: 更高的字數上限

# premium_features5
source: Custom API Host
de: Benutzerdefinierter API-Host
fr: Hôte d'API personnalisé
ja: カスタムAPIホスト
ru: Пользовательский API-хост
zh: 支持自定义域名
zh_tw: 支援自定義域名

# premium_features6
source: No Ad
de: Keine Werbung
fr: Pas de publicité
ja: 広告なし
ru: Без рекламы
zh: 纯净无广告
zh_tw: 純淨無廣告

source: Subscribe
de: Abonnieren
fr: S'abonner
ja: 購読する
ru: Подписаться
zh: 立即订阅
zh_tw: 立即訂閱

source: Purchase Failure
de: Kauf fehlgeschlagen
fr: Échec de l'achat
ja: 購入失敗
ru: Ошибка при покупке
zh: 支付失败，请稍后再试
zh_tw: 支付失敗，請稍後再試

# purchase_success
source: Congratulations Subscribe Success!
de: Herzlichen Glückwunsch! Abonnement erfolgreich abgeschlossen!
fr: Félicitations, abonnement réussi !
ja: 購読成功、おめでとうございます！
ru: Поздравляем! Подписка успешно оформлена!
zh: 恭喜会员开通成功
zh_tw: 恭喜會員開通成功

source: Purchase Cancel
de: Kauf abgebrochen
fr: Annuler l'achat
ja: 購入キャンセル
ru: Отменить покупку
zh: 支付已取消
zh_tw: 支付已取消

# purchase_error
source: Purchase Unknown Error
de: Unbekannter Kauffehler
fr: Erreur d'achat inconnue
ja: 購入エラー
ru: Неизвестная ошибка при покупке
zh: 支付出错，请稍后再试
zh_tw: 支付出錯，請稍後再試

source: Terms Use
de: Klausel
fr: Conditions d'utilisation
ja: 利用規約
ru: Условия использования
zh: 使用条款
zh_tw: 使用條款

source: Privacy Policy
de: Politik
fr: Politique de confidentialité
ja: プライバシーポリシー
ru: Политика конфиденциальности
zh: 隐私政策
zh_tw: 隱私策略

source: Restore
de: Wiederherstellen
fr: Restaurer
ja: 復元
ru: Восстановить
zh: 恢复
zh_tw: 恢復

# current_level
source: Current
de: Aktuell
fr: Niveau actuel
ja: 現在のレベル
ru: Текущий уровень
zh: 当前会员等级
zh_tw: 當前會員等級

# your_are_not_membership
source: You have not subscribed to the membership service yet
de: Sie haben den Mitgliederservice noch nicht abonniert
fr: Vous n'avez pas encore souscrit au service d'adhésion
ja: まだメンバーシップサービスに加入していません
ru: Вы еще не подписались на услуги членства
zh: 很抱歉，您还没有订阅会员服务哦，该功能仅对会员用户开放！
zh_tw: 很抱歉，您還沒有訂閱會員服務哦，該功能僅對會員用戶開放！

# refuse
source: Not now
de: Nicht jetzt
fr: Pas maintenant
ja: 今はしない
ru: Не сейчас
zh: 残忍拒绝
zh_tw: 殘忍拒絕

source: Nothing to Restore
de: Nichts wiederherzustellen
fr: Rien à restaurer
ja: 復元するものはありません
ru: Нечего восстанавливать
zh: 您还没有订阅过哦
zh_tw: 您還沒有訂閱過哦

# premium_weekly
source: Weekly
ja: 週刊
zh_tw: 周會員

# premium_monthly
source: Monthly
ja: 月刊
zh_tw: 月會員

# premium_quarterly
source: Quarterly
ja: 四半期
zh_tw: 季度會員

# premium_yearly
source: Yearly
ja: 年度
zh_tw: 年度會員

source: Ask Anything
ja: 何でも聞いてください
zh_tw: 隨便聊聊

# today_conversation_limit_tips
source: There are only 5 chats left today, so subscribe to a member and enjoy unlimited chats
ja: 今日は{times}つの無料メッセージがあります
zh_tw: 您今天還有{times}條免費消息

source: Upgrade Premium
ja: プレミアム
zh_tw: 升級高級版

# unlock_premium_tips
source: Unlimited sessions & No Ad
ja: 無制限のセッション 広告なし
zh_tw: 解鎖無限會話次數&免廣告

source: Proxy Host
ja: プロキシホルスト
zh_tw: 代理位址

source: Share App
ja: シャラップ
zh_tw: 分享應用

source: Rate App
ja: ラタップ
zh_tw: 給個好評

source: Feedback
ja: フェーダーバッハ
zh_tw: 反饋

source: API Key
de: API-Schlüssel
fr: Clé d'API
ru: API ключ

source: API Host
fr: Hôte de l'API
ru: API хост
zh: 接口域名
